Revit 2026 API

# BuiltInFailuresPartMakerMethodForWallFailures Class

---

Failures related to parts related to walls.

SystemObject Autodesk.Revit.DBBuiltInFailuresPartMakerMethodForWallFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PartMakerMethodForWallFailures
```
```vb
Public NotInheritable Class PartMakerMethodForWallFailures
```
```cpp
public ref class PartMakerMethodForWallFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PartMakerMethodForWallFailures = class end
```

The BuiltInFailuresPartMakerMethodForWallFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CouldNotAdjustWallPartsAtJoin | Failed to extend or trim some layer at an end join |
|  | CouldNotCreateWallPart | Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry. |
|  | CouldNotCreateWallPartDueToWallJoin | Failed to create basic layer geometry due to an excessively short edge created by wall join. |

#### Reference

Autodesk.Revit.DB Namespace